'use strict';
//============================================== #1 ========================================================

// Объяви две переменные хранящие название и цену товара: name и price
// Присвой переменным следующие характеристики товара (сразу при объявлении)
// название: Генератор защитного поля
// цена: 1000
// Используя шаблонную строку выведи в консоль информацию о товаре, получится:
//  'Выбран «Генератор защитного поля», цена за штуку 1000 кредитов'.
// Присвой товару новую цену - 2000
// Используя шаблонную строку выведи в консоль информацию о товаре, получится:
//  'Выбран «Генератор защитного поля», цена за штуку 2000 кредитов'.


// const name = "Генератор защитного поля";
// let price = 1000;
// console.log(`Выбран ${name}, цена за штуку ${price} кредитов`);
// price = 2000;
// console.log(`Выбран ${name}, цена за штуку ${price} кредитов`)


//============================================== #2 ========================================================

// Напиши скрипт проверки количества товаров на складе. Есть 
// переменные total (количество товаров на складе) и ordered (единиц товара в заказе).
// Сравни эти значения и по результатам выведи:
// Если в заказе указано число, превышающее количество товаров на складе,
//  то выведи сообщение "На складе недостаточно твоаров!".
// В другом случае выводи сообщение "Заказ оформлен, с вами свяжется менеджер".
// Проверь работоспособность кода с разными значениями переменной ordered, например 20, 80 и 130.

// const total = 100;
// const ordered = 20;
// if (total < ordered) {
//     console.log("На складе недостаточно товаров!")
// } else {
//     console.log("Заказ оформлен, с вами свяжется менеджер")
// }


//============================================== #3 ========================================================







//============================================== #1 ========================================================
//============================================== #1 ========================================================
//============================================== #1 ========================================================
//============================================== #1 ========================================================
//============================================== #1 ========================================================
//============================================== #1 ========================================================
//============================================== #1 ========================================================
//============================================== #1 ========================================================
//============================================== #1 ========================================================
//============================================== #1 ========================================================
//============================================== #1 ========================================================
//============================================== #1 ========================================================